/*******************************************************************************
* タイトル:		enemyヘッダ-
* プログラム名:	enemy.h
* 作成者:		GP11B341 01 飯塚春輝
* 作成日:		2018/06/29
*******************************************************************************/
#ifndef ENEMY_H
#define ENEMY_H

/*******************************************************************************
* インクルードファイル****
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define ENEMY_MAX	(2)			// enemyの数

/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct					// キャラクターの基本構造体
{
	char	name[NAME_MAX];		// 名前
	int		HP;					// 体力
	int		MP;					// マジックポイント
	int		ATK;				// 攻撃力
	int		DEF;				// 防御力
	int		EXP;				// 経験値
	int fx;						// フィールドX座標
	int fy;						// フィールドY座標

} ENEMY;



/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
// この4パターンもDirectXでイヤと言う程出てくるので今のうちに体で覚えるべし！
// 頑張れそうな人は、この関数達をファイル分割すると尚良し！！（例えば、enemy.cpp/enemy.h）
void InitEnemy(void);			// エネミーの初期化
void UpdateEnemy(void);			// エネミーの更新処理
void DrawEnemy(void);			// エネミーの描画処理
void UninitEnemy(void);			// エネミーの終了処理
ENEMY *GetEnemyAdr(int pno);	// enemyのアドレスを取得



#endif
