/*******************************************************************************
* タイトル:		プレイヤーヘッダー
* プログラム名:	player.h
* 作成者:		GP11B341 01 飯塚春輝
* 作成日:		2018/06/29
*******************************************************************************/
#ifndef PLAYER_H
#define PLAYER_H

/*******************************************************************************
* インクルードファイル****
*******************************************************************************/


/*******************************************************************************
* マクロ定義
*******************************************************************************/
#define PLAYER_MAX	(1)			// プレイヤーの数


/*******************************************************************************
* 構造体定義
*******************************************************************************/
typedef struct					// キャラクターの基本構造体
{
	char	name[NAME_MAX];		// 名前
	int		MAX_HP;				// 最大HP
	int		MAX_MP;				// 最大MP
	int		MAX_LV;				//今のレベル
	int		HP;					// 体力
	int		MP;					// マジックポイント
	int		ATK;				// 攻撃力
	int		DEF;				// 防御力
	int		EXP;				// 経験値
	int		LV;					//レベル
	int fx;						// フィールドX座標
	int fy;						// フィールドY座標

} PLAYER;


/*******************************************************************************
* プロトタイプ宣言
*******************************************************************************/
void InitPlayer(void);			// プレイヤーの初期化
void UpdatePlayer(void);		// プレイヤーの更新処理
void DrawPlayer(void);			// プレイヤーの描画処理
void UninitPlayer(void);		// プレイヤーの終了処理
PLAYER *GetPlayerAdr(int pno);	// プレイヤーのアドレスを取得



#endif
